Repository: pypi-data/pypi-mirror-248
Catalog: packages/turcar/turcar-0.0.91.tar.gz/turcar-0.0.91/turcar/locale/*/LC_MESSAGES/thonny.po
Languages: ca_es

source: Not supported
ca_es: No suportat

source: Not available
ca_es: No disponible

source: You need to stop your program before launching the package manager.
ca_es: Has d'aturar el programa abans de llançar el gestor de paquets.

source: Open evaluated values in Object inspector
ca_es: Obre els valors a avaluar a l'inspector d'objectes

source: Python executable
ca_es: Executable del Python

source: NB! File selection button may not work properly when selecting executables from a virtual environment. In this case choose the 'activate' script instead of the interpreter (or enter the path directly to the box)!
ca_es: NB! El botó de selecció de fitxers pot no funcionar correctament en seleccionar executables d'un entorn virtual. En aquest cas, tria en el seu lloc l'script 'activa' de l'intèrpret (o introdueix el camí directament al quadre)!

source: Remote Python 3 (SSH)
ca_es: Python 3 Remot (SSH)

source: Not connected
ca_es: No connectat

source: no absolute lib directory in sys.path
ca_es: no hi ha cap directori Lib absolut a sys.path

source: Search on PyPI
ca_es: Cerca a PyPI

source: Open in turcar's text editor
ca_es: Obre a l'editor de text de turcar

source: Storage space on this drive or filesystem
ca_es: Espai d'emmagatzematge en aquesta unitat o sistema de fitxers

source: total space
ca_es: Espai total

source: used space
ca_es: Espai utilitzat

source: free space
ca_es: Espai lliure

source: Storage info
ca_es: Informació d'emmagatzematge

source: Replace tabs with spaces
ca_es: Substitueix els tabuladors per espais

source: Highlight tab characters
ca_es: Ressalta els caràcters de tabulació

source: Indent with tab characters (not recommended for Python)
ca_es: Indenta amb caràcters de tabulació (no es recomana per a Python)

source: Name
ca_es: Nom

source: Size (bytes)
ca_es: Mida(bytes)

source: Enter name for new directory under %s
ca_es: Introdueix el nom del directori nou a %s

source: Nothing selected
ca_es: No s'ha seleccionat res

source: Select an item and try again!
ca_es: Selecciona un element i torna a provar-ho!

source: Open from %s
ca_es: Obre des de %s

source: Save to %s
ca_es: Desa a %s

source: File name:
ca_es: Nom del fitxer:

source: Value ID
ca_es: ID del valor

source: Value
ca_es: Valor

source: Save password
ca_es: Desa la contrassenya

source: Function call at %s
ca_es: Crida de funció a %s

source: Local variables
ca_es: Variables locals

source: Function
ca_es: Funció

source: Location
ca_es: Ubicació

source: If last command raised an exception then this view will show the stacktrace.
ca_es: Si l'última ordre ha produït una excepció, aquesta vista mostrarà el seguiment de la pila.

source: Data
ca_es: Dada

source: Attributes
ca_es: Atributs

source: Index
ca_es: Índex

source: Key ID
ca_es: ID de la clau

source: Key
ca_es: Clau

source: Back to %s
ca_es: Torna a %s

source: Port or WebREPL
ca_es: Port o WebREPL

source: Password
ca_es: Contrasenya

source: Source code
ca_es: Codi font

source: Use Tk file dialogs instead of Zenity
ca_es: Usa quadres de diàleg de fitxers Tk en lloc del Zenity

source: Select if the file dialogs end up behind the main window
ca_es: Selecciona si els diàlegs de fitxer acaben darrere de la finestra principal

source: Environment variables (one KEY=VALUE per line)
ca_es: Variables d'entorn (una CLAU=VALOR per línia)

source: New file
ca_es: Nou fitxer

source: Rename
ca_es: Reanomenar

source: Rename '%s'
ca_es: Reanomena '%s'

source: Enter new name
ca_es: Introdueix el nou nom

source: Paste failed
ca_es: Ha fallat a l'enganxar

source: There are conflicting folders
ca_es: Hi ha carpetes en conflicte

source: File already exists
ca_es: El fitxer ja existeix

source: If it is a text file, then you can configure it to open in turcar by right-clicking it and selecting 'Configure ... files'.
ca_es: Si és un fitxer de text, aleshores pots configurar-lo per obrir-lo a turcar fent clic amb el botó dret i seleccionant 'Configura... fitxers'.

source: Python files
ca_es: Fitxers del Python

source: File is gone
ca_es: El fitxer ha desaparegut

source: Do you want to also close the editor?
ca_es: Vols tancar també l'editor?

source: External modification
ca_es: Modificació externa

source: Do you want to discard current editor content and reload the file from disk?
ca_es: Vols descartar el contingut actual de l'editor i tornar a carregar el fitxer des del disc?

source: Python files usually have .py extension.
ca_es: Els fitxers Python normalment tenen extensió .py.

source: Did you mean '%s'?
ca_es: Volíes dir «%s»?

source: Move / rename...
ca_es: Mou / reanomena...

source: Go to line...
ca_es: Ves a la línia...

source: Line number
ca_es: Número de línia

source: Do you want to save files before closing?
ca_es: Vols desar els fitxers abans de sortir?

source: Do you want to save file before closing?
ca_es: Vols desar els fitxers abans de sortir?

source: Save On Close
ca_es: Desa al Tancar

source: Command not available
ca_es: Ordre no disponible

source: This command is not available if turcar is run via Flatpak
ca_es: Aquesta ordre no està disponible si el turcar s'està executant via Flatpak

source: Support Ukraine
ca_es: Dona suport a Ucraïna

source: Which kind of interpreter should turcar use for running your code?
ca_es: Quin intèrpret hauria d'utilitzar turcar per a executar el teu codi?

source: Show parameter info
ca_es: Mostra la informació del paràmetre

source: Automatically show parameter info after typing '('
ca_es: Mostra automàticament la informació del paràmetre després d'escriure '('

source: Automatically propose completions while typing
ca_es: Proposa automàticament les complecions mentre s'escriu

source: Automatically show documentation for completions
ca_es: Mostra automàticament la documentació per a les complecions

source: Request completions with Tab-key in editors
ca_es: Demana complecions amb la tecla de tabulació en els editors

source: Request completions with Tab-key in Shell
ca_es: Demana complecions amb la tecla de tabulació a la consola

source: Problem
ca_es: Problema

source: Could not find definition
ca_es: No s'ha pogut trobar la definició

source: Clear Shell before starting new process (Run, Debug, Stop/Restart, ...)
ca_es: Neteja la consola abans d'iniciar un procés nou (Executa, Depura, Atura/Reinicia, ...)

source: turcar's Python
ca_es: Python de turcar

source: Interrupt working program on connect
ca_es: Interromp el programa de treball en connectar

source: Synchronize device's real time clock
ca_es: Sincronitza el rellotge de temps real del dispositiu

source: Use local time in real time clock
ca_es: Utilitza l'hora local en el rellotge de temps real

source: Restart interpreter before running a script
ca_es: Reinicia l'intèrpret abans d'executar un script

source: This doesn't look like MicroPython/CircuitPython package. Are you sure you want to install it?
ca_es: Això no sembla un paquet MicroPython/CircuitPython. Segur que vols instal·lar-lo?

source: Moving to Trash
ca_es: S'està movent a la paperera

source: Move %s to Trash?
ca_es: Vols moure %s a la paperera?

source: Moving %s to Trash
ca_es: S'està movent %s a la paperera

source: Open in default external app
ca_es: Obre en l'aplicació externa predeterminada

source: Opening remote files in external app is not supported.
ca_es: No s'admet obrir fitxers remots en aplicacions externes.

source: If the file needs to be opened in external app, then download it to a local directory and open it from there!
ca_es: Si cal obrir el fitxer en una aplicació externa, baixa-ho a un directori local i obre-ho des d'allà!

source: Looks like '%s' was deleted or moved.
ca_es: Sembla que '%s' s'ha suprimit o mogut.

source: Looks like '%s' was modified outside of the editor.
ca_es: Sembla que '%s' s'ha modificat fora de l'editor.

source: NB! turcar only supports Python %s and later
ca_es: NB! turcar només admet Python %s i posteriors

source: Go to line
ca_es: Ves a la línia

source: Support
ca_es: Suport

source: Could not save
ca_es: No s'ha pogut desar

source: Warning
ca_es: Avís

source: If you quote the value of an environment variable, the quotes will be part of the value. Did you intend this?
ca_es: Si cites el valor d'una variable d'entorn, les cometes formaran part del valor. Tenies aquesta intenció?

source: Install MicroPython
ca_es: Instal·la el MicroPython

source: Install CircuitPython
ca_es: Instal·la el CircuitPython

source: Make uploaded shebang scripts executable
ca_es: Fer executables els scripts amb shebang carregats

source: Make saved shebang scripts executable
ca_es: Fa executables els scripts amb Shebang desats

source: Activate virtual environment
ca_es: Activa l'entorn virtual

source: Target
ca_es: Objectiu

source: Visualize current script at Python Tutor
ca_es: Visualitza l'script actual al Tutor de Python

source: Line
ca_es: Línia

source: No line marked with #todo found
ca_es: No s'ha trobat cap línia marcada amb #todo

source: Install or update %s
ca_es: Instal·la o actualitza %s

source: Local Python 3
ca_es: Python 3 local

source: You can activate an existing virtual environment also via the right-click context menu in the file navagation when selecting a virtual environment folder, or the 'pyveng.cfg' file inside.
ca_es: També pots activar un entorn virtual existent mitjançant el menú contextual fent clic dret al fitxer de navegació quan seleccionis una carpeta d'entorn virtual o el fitxer 'pyveng.cfg' que hi ha a dins.

source: Preparations (skip the VS Code part)
ca_es: Preparacions (omet la part del codi VS)

source: Default password
ca_es: Contrasenya per defecte

source: Information
ca_es: Informació

source: For debugging the program must be saved first.
ca_es: Per depurar el programa l'has de desar primer.

source: %s doesn't look like a text file
ca_es: %s no sembla un fitxer de text

source: Problem loading file
ca_es: Problema al carregar el fitxer

source: This file seems to have problems with encoding. Make sure it is in UTF-8 or contains proper encoding hint.
ca_es: Sembla que aquest fitxer té problemes amb la codificació. Assegura't que estigui en UTF-8 o que contingui la codificació adequada.

source: File is open
ca_es: El fitxer està obert

source: This file is already open in turcar. If you want to save with this name, close the existing editor first!
ca_es: Aquest fitxer ja està obert a turcar. Si el vols desar amb aquest nom, primer tanca l'editor existent!

source: Permission Error
ca_es: Error de permís

source: Looks like this file or folder is not writable.
ca_es: Sembla que no es pot escriure en aquest fitxer o carpeta.

source: Back-end is not ready
ca_es: El back-end no està preparat

source: Where to save to?
ca_es: A on vols desar-ho?

source: Potential problem
ca_es: Problema potencial

source: If you name your script '%s', you won't be able to import the library module named '%s'
ca_es: Si li poses el nom '%s' al teu script, no podràs importar el mòdul de la biblioteca anomenat ''%s

source: Do you still want to use this name for your script?
ca_es: Encara vols utilitzar aquest nom per al teu script?

source: Got permission error when trying to load %s
ca_es: S'ha obtingut un error de permís intentant carregar %s

source: Try opening it with File => Open.
ca_es: Prova d'obrir-lo amb Fitxer => Obre.

source: Permission error
ca_es: Error de permís

source: Allow running unnamed programs
ca_es: Permet executar programes sense nom

source: License
ca_es: Llicència

source: Warn if a user module shadows a library module
ca_es: Avisa si un mòdul d'usuari fa ombra 'shadow' a un mòdul de biblioteca

source: Search micropython-lib and PyPI
ca_es: Cerca micropython-lib i el PyPI
