Repository: pypi-data/pypi-mirror-248
Catalog: packages/turcar/turcar-0.0.91.tar.gz/turcar-0.0.91/turcar/locale/*/LC_MESSAGES/thonny.po
Languages: ca_es

source: File
ca_es: Fitxer

source: Edit
ca_es: Edita

source: View
ca_es: Visualitza

source: Run
ca_es: Executa

source: Tools
ca_es: Eines

source: Help
ca_es: Ajuda

source: Exit
ca_es: Surt

source: Decrease font size
ca_es: Redueix la mida de la lletra

source: Focus editor
ca_es: Ves a l’editor

source: Focus shell
ca_es: Ves a la consola

source: Maximize view
ca_es: Maximitza vista

source: Full screen
ca_es: Pantalla completa

source: Program arguments
ca_es: Paràmetres de l’execució del programa

source: About turcar
ca_es: Sobre turcar

source: Made in University of Tartu, Estonia, with the help from open-source community, Raspberry Pi Foundation and Cybernetica AS
ca_es: Desenvolupat a la universitat de Tartu, Estònia, amb l'ajuda de la Comunitat de codi obert, la Raspberry Pi Foundation i Cybernetica AS

source: This program comes with ABSOLUTELY NO WARRANTY! It is free software, and you are welcome to redistribute it under certain conditions, see https://opensource.org/licenses/MIT for details
ca_es: Aquest programa ve COMPLETAMENT SENSE GARANTIA! És programari lliure, per la qual cosa pots redistribuir-ho sota unes determinades condicions, veure https://opensource.org/licenses/MIT per a més detalls

source: Version history
ca_es: Historial de versions

source: Report problems
ca_es: Informa d'un problema

source: Open Assistant automatically when program crashes with an exception
ca_es: Obre l'Assistent automàticament si el programa es bloqueja amb una excepció

source: Open Assistant automatically when it has warnings for your code
ca_es: Obre l'Assistent automàticament si hi ha avisos en el teu codi

source: Perform selected Pylint checks
ca_es: Realitza les comprovacions Pylint seleccionades

source: Perform MyPy checks
ca_es: Realitza les comprovacions MyPy

source: Disabled checks (one id per line)
ca_es: Desactiva comprovacions (un id per línia)

source: Assistant
ca_es: Assistent

source: Auto-complete
ca_es: Completa automàticament

source: Interpreter
ca_es: Intèrpret

source: About Birdseye
ca_es: Sobre el Birdseye

source: Birdseye is a Python debugger which needs to be installed separately. Do you want to open the help page and learn more?
ca_es: Birdeyes és un depurador de Python que s’ha d’instal·lar a part. Vols obrir la pàgina web d’ajuda i obtenir més informació?

source: Debug current script (birdseye)
ca_es: Depura l’script actual (Birdeyes)

source: Toggle comment
ca_es: Activa/desactiva com a comentari

source: Comment out
ca_es: Converteix a comentari

source: Uncomment
ca_es: Desactiva com a comentari

source: Undo
ca_es: Desfés

source: Redo
ca_es: Refés

source: Cut
ca_es: Retalla

source: Copy
ca_es: Copia

source: Paste
ca_es: Enganxa

source: Select all
ca_es: Selecciona-ho tot

source: Run to cursor
ca_es: Executa fins on està el cursor

source: Can't close yet
ca_es: Encara no es pot tancar

source: Use "Stop" command if you want to cancel debugging
ca_es: Utilitza l'ordre "Stop" si vols cancel·lar la depuració

source: Dock user windows
ca_es: Ancora les finestres de l’usuari

source: Highlight matching names
ca_es: Ressalta les coincidències de noms

source: Highlight local variables
ca_es: Ressalta les variables locals

source: Highlight parentheses
ca_es: Ressalta els parèntesi

source: Highlight syntax elements
ca_es: Ressalta els elements sintàctics

source: Highlight current line (requires reopening the editor)
ca_es: Ressalta la línia actual (requereix obrir de nou l’editor)

source: Show line numbers
ca_es: Mostra els números de línia

source: Recommended maximum line length (Set to 0 to turn off margin line)
ca_es: Longitud de línia màxima recomanada (posar a 0 per a desactivar el marge de línia)

source: Editor
ca_es: Edita

source: Export usage logs...
ca_es: Exporta registres d'ús...

source: Events
ca_es: Esdeveniment

source: Files
ca_es: Arxius

source: Find & Replace
ca_es: Cerca i reemplaça

source: Find:
ca_es: Cerca:

source: Replace with:
ca_es: Reemplaça amb:

source: Case sensitive
ca_es: Distingeix entre majúscules i minúscules

source: Up
ca_es: Amunt

source: Down
ca_es: Avall

source: Find
ca_es: Cerca

source: Replace
ca_es: Reemplaça

source: Replace+Find
ca_es: Reemplaça+Cerca

source: Replace all
ca_es: Reemplaça-ho tot

source: Enter string to be replaced.
ca_es: Introdueix la cadena a reemplaçar.

source: The specified text was not found!
ca_es: El text especificat no s'ha trobat!

source: Allow only single turcar instance
ca_es: Permet només una instància del turcar

source: Reopen all files from previous session
ca_es: Torna a obrir tots els arxius de la sessió anterior

source: Disable notification sound
ca_es: Desactiva els sons de notificació

source: Font scaling mode
ca_es: Mode d’escalat de la lletra

source: Heap mode is on. Close Heap view to turn it off.
ca_es: Mode Heap activat. Selecciona Visualització Heap per a tancar-ho.

source: Language
ca_es: Idioma

source: This box is meant for your working notes -- assignment instructions, code snippets, whatever. Everything will be saved automatically and loaded when you open turcar next time. Feel free to delete this text to make room for your own notes.
ca_es: Aquesta casella és per a les teves notes de treball -- instruccions, fragments de codi, o altres. Tot es guardarà automàticament i es carregarà quan obri turcar la pròxima vegada. Esborra aquest text per a fer lloc a les teves notes.

source: Previous object
ca_es: Objecte anterior

source: Next object
ca_es: Següent objecte

source: Object inspector
ca_es: Inspector d'objectes

source: Outline
ca_es: Esquema

source: Pygame Zero mode
ca_es: Mode Pygame Zero

source: Uninstall
ca_es: Desinstal·lar

source: Close
ca_es: Tanca

source: Click
ca_es: Clic

source: here
ca_es: Aquí

source: Upgrade
ca_es: Actualitza

source: Install
ca_es: Instal·la

source: Could not find the package from PyPI.
ca_es: No s'ha pogut trobar el paquet al PyPI.

source: Latest stable version
ca_es: Última versió estable

source: Latest version
ca_es: Última versió

source: Summary
ca_es: Resum

source: Author
ca_es: Autor

source: Homepage
ca_es: Pàgina d'inici

source: Bugtracker
ca_es: Rastrejador d'errors

source: Documentation
ca_es: Documentació

source: PyPI page
ca_es: Pàgina de PyPI

source: Requires
ca_es: Requereix

source: Really uninstall?
ca_es: Realment vols desinstal·lar-ho?

source: Are you sure you want to uninstall it?
ca_es: Estàs segur/a que vols desinstal·lar-ho?

source: Back to current frame
ca_es: Tornar al marc actual

source: This computer
ca_es: Aquest ordinador

source: Refresh
ca_es: Actualitza

source: Focus into
ca_es: Centra-se en

source: You need to select a file!
ca_es: Has de seleccionar un fitxer!

source: Overwrite?
ca_es: Sobreescriure?

source: Do you want to overwrite '%s' ?
ca_es: Vols sobreescriure '%s'?

source: New
ca_es: Nou

source: Open...
ca_es: Obre...

source: Load
ca_es: Carrega

source: Recent files
ca_es: Arxius recents

source: Close all
ca_es: Tanca-ho tot

source: Save
ca_es: Desa

source: Save as...
ca_es: Desa com...

source: Save copy...
ca_es: Desa una còpia...

source: turcar options
ca_es: Opcions del turcar

source: Run current script
ca_es: Executa l'script actual

source: Run current script in terminal
ca_es: Executa l'script actual al terminal

source: Stop/Restart backend
ca_es: Atura/Reprèn back-end

source: Stop
ca_es: Atura

source: Interrupt execution
ca_es: Interromp l’execució

source: Send EOF / Soft reboot
ca_es: Envia EOF / Reinici suau

source: Disconnect
ca_es: Desconnecta

source: Python interpreters
ca_es: Intèrprets de Python

source: all files
ca_es: Tots el fitxers

source: Select empty directory for new virtual environment
ca_es: Selecciona un directori buit per al nou entorn virtual

source: Bad directory
ca_es: Directori incorrecte

source: Selected directory is not empty. Select another or cancel.
ca_es: El directori seleccionat no està buit. Selecciona un altre o cancel·la.

source: Creating virtual environment
ca_es: Creant entorn virtual

source: Clear shell
ca_es: Neteja la consola

source: Plotter
ca_es: Plòter

source: Clear
ca_es: Neteja

source: Show Plotter
ca_es: Mostra el Plòter

source: For performance reasons, Shell avoids showing very long lines in full (see Tools => Options => Shell). Here you can interact with the original text fragment.
ca_es: Per raons de rendiment, la consola evita mostrar línies molt llargues (vegeu Eines => Opcions => Consola). Aquí pots interactuar amb el fragment de text original.

source: Wrap text (may be slow)
ca_es: Ajusta el text (pot ser lent)

source: Copy to clipboard
ca_es: Copia al porta-retalls

source: Squeezed text (%d characters)
ca_es: Text reduït (%d caràcters)

source: Plotter visualizes series of numbers printed to the Shell.
ca_es: El plòter visualitzarà sèries de números impresos a la consola.

source: See Help for details.
ca_es: Vegeu l'ajuda per a més detalls.

source: Close others
ca_es: Tanca altres

source: Copying
ca_es: Copiant

source: Copying %s to %s
ca_es: Copiant %s a %s

source: Cancel
ca_es: Cancel·la

source: OK
ca_es: D'acord

source: Select All
ca_es: Selecciona-ho tot

source: Shell
ca_es: Consola

source: Options...
ca_es: Opcions...

source: Increase font size
ca_es: Augmenta la mida de la lletra

source: Change font size
ca_es: Canvia la mida de la lletra

source: Zoom
ca_es: Amplia

source: Exit turcar
ca_es: Surt del turcar

source: Quit
ca_es: Surt

source: Overwriting theme '%s'
ca_es: Sobreescriu el tema '%s'

source: Program arguments:
ca_es: Arguments del programa:

source: Regular mode
ca_es: Mode regular

source: Configuration has been updated. Restart turcar to start working in regular mode. (See 'Tools → Options → General' if you change your mind later.)
ca_es: S'ha actualitzat la configuració. Reiniciï turcar per començar a treballar en mode regular. (Consulti 'Eines → Opcions → General' si canvia d'opinió més endavant.)

source: Program tree
ca_es: Arbre del programa

source: Resume
ca_es: Reprèn

source: Run / resume
ca_es: Executa/reprèn

source: Debug current script
ca_es: Depura l'script actual

source: Debug
ca_es: Depura

source: Debug current script (nicer)
ca_es: Depura l’script actual (millor)

source: Debug current script (faster)
ca_es: Depura l’script actual (ràpid)

source: Step over
ca_es: Saltant

source: Over
ca_es: Salta

source: Step into
ca_es: Entrant

source: Into
ca_es: Entra

source: Step out
ca_es: Sortint

source: Out
ca_es: Surt

source: Step back
ca_es: Torna enrere

source: Back
ca_es: Enrere

source: Stack
ca_es: Pila

source: Exception
ca_es: Excepció

source: Log program usage events
ca_es: Registra els esdeveniments d’ús del programa

source: Debug mode (provides more detailed diagnostic logs)
ca_es: Mode de depuració (amb diagnòstic detallat dels registres)

source: UI mode
ca_es: Mode IU Interfície Usuari

source: UI scaling factor
ca_es: Factor d’escalat de IU

source: NB! Restart turcar after changing these options!
ca_es: NB! Reinicia turcar després de canviar les opcions!

source: INSTALL
ca_es: INSTAL·LA

source: Browse the packages
ca_es: Navega pels paquets

source: With current interpreter you can only browse the packages here. Use 'Tools → Open system shell...' for installing, upgrading or uninstalling.
ca_es: Amb l'intèrpret actual només pots navegar pels paquets aquí. Utilitza 'Eines → Consola del sistema...' Per a instal·lar, actualitzar o desinstal·lar.

source: Packages' directory
ca_es: Directori dels paquets

source: Install from PyPI
ca_es: Instal·la des del PyPI

source: If you don't know where to get the package from, then most likely you'll want to search the Python Package Index. Start by entering the name of the package in the search box above and pressing ENTER.
ca_es: Si no saps d'on està el paquet, probablement vols buscar-lo en Python Package Index. Introdueix el nom del paquet en el quadre de cerca i pressiona ENTER.

source: to locate requirements.txt file and install the packages specified in it.
ca_es: Per a localitzar el fitxer requirements.txt i instal·lar els paquets allí especificats.

source: Click
ca_es: Clic

source: to locate and install the package file (usually with .whl, .tar.gz or .zip extension).
ca_es: Per a localitzar i instal·lar el fitxer del paquet (normalment amb extensió .whl, .tar.gz o .zip).

source: Upgrade or uninstall
ca_es: Actualitza o desinstal·la

source: Start by selecting the package from the left.
ca_es: Comenci seleccionant el paquet de l'esquerra.

source: This dialog lists all available packages, but allows upgrading and uninstalling only packages from
ca_es: Aquest diàleg llista tots els paquets disponibles, però només actualitza i desinstal·la paquets de

source: New packages will be also installed into this directory. Other locations must be managed by alternative means.
ca_es: També s'instal·laran nous paquets en aquest directori. Altres ubicacions hauran de ser gestionades per medis alternatius.

source: Installed version:
ca_es: Versió instal·lada:

source: Installed to:
ca_es: Instal·lat per a:

source: Please check your spelling!
ca_es: Si us plau, verifica l'ortografia!

source: Could not find the package info from PyPI.
ca_es: No es va poder trobar la informació del paquet de PyPI.

source: Error code:
ca_es: Codi d'error:

source: Can't find package name from the list:
ca_es: No s'ha pogut trobar el nom del paquet de la llista:

source: Package '{}' is required for installing and uninstalling other packages.
ca_es: El paquet '{}' es requereix per a instal·lar i desinstal·lar altres paquets.

source: Package
ca_es: Paquet

source: Manage packages for %s
ca_es: Administra paquets per a %s

source: Confirmation
ca_es: Confirmació

source: Looks like you are installing a turcar-related package. If you meant to install a turcar plugin, then you should choose 'Tools → Manage plugins...' instead Are you sure you want to install %s for the back-end?
ca_es: Sembla que estàs instal·lant un paquet relacionat amb turcar. Si el que volies és instal·lar un plugin de turcar, llavors hauries de triar 'Eines → Administrar plugins...' Segur que vols instal·lar %s per al back-end?

source: NB! There may be another version available which is compatible with current turcar version. Click on '...' button to choose the version to install.
ca_es: NB! Ha d'haver-hi una altra versió disponible que sigui compatible amb la versió actual de turcar. Fes clic en el botó '...' per a triar la versió i instal·lar-la.

source: turcar plugin without requirements
ca_es: Plugin de turcar sense requisits

source: Unsuitable requirements
ca_es: Requisits inadequats

source: This package requires different turcar version:
ca_es: Aquest paquet requereix una versió diferent de turcar:

source: If you still want it, then please install it from the command line.
ca_es: Si encara el vols, instal·la-ho des de la línia d'ordres.

source: NB! You need to restart turcar after installing / upgrading / uninstalling a plug-in.
ca_es: NB! És necessari reiniciar turcar després d'instal·lar / actualitzar / desinstal·lar un plug-in.

source: turcar plug-ins
ca_es: Plug-ins del turcar

source: Advanced install / upgrade / downgrade
ca_es: Instal·lació avançada / actualització / desactualització

source: Desired version
ca_es: Versió desitjada

source: Upgrade dependencies
ca_es: Actualitza les dependències

source: Requires:
ca_es: Requereix:

source: Manage packages...
ca_es: Gestiona els paquets...

source: Manage plug-ins...
ca_es: Gestiona els plug-ins...

source: Open replayer...
ca_es: Obre el reproductor...

source: Change working directory to script directory on Run / Debug
ca_es: Canvia el directori de treball al directori de l'script a executar / depurar

source: Show function calls (frames) in separate windows
ca_es: Mostra les crides a les funcions (marcs) en finestres separades

source: Uncheck if you want more traditional experience.
ca_es: Desmarca-ho si vols una experiència més tradicional.

source: Open and close Stack view automatically
ca_es: Obre i tanca la vista de pila automàticament

source: Opens the Stack view on first call and closes it when program returns to main frame.
ca_es: Obre la vista de pila a la primera crida i la tanca quan el programa torna al marc principal.

source: Allow stepping into libraries (ie. outside of main script directory)
ca_es: Permet passar a les biblioteques (per exemple. fora del directori principal de l'script)

source: May make debugging slower.
ca_es: Pot fer que la depuració sigui més lenta.

source: Preferred debugger
ca_es: Depurador preferit

source: (used when clicking Debug toolbar button)
ca_es: (s'utilitza en fer clic al botó Depura de la barra d'eines)

source: Birdseye port
ca_es: Port per al Birdeyes

source: (restart turcar after changing this)
ca_es: (reinicia el turcar després de canviar això)

source: Run & Debug
ca_es: Executa i depura

source: Terminal emulation
ca_es: Terminal d'emulació

source: supports basic ANSI-colors and styles
ca_es: admet colors i estils ANSI bàsics

source: Maximum number of lines to keep.
ca_es: Nombre màxim de línies a mantenir.

source: NB! Large values may cause poor performance!
ca_es: NB! Els valors grans poden causar un mal rendiment!

source: Maximum length of line fragments before squeezing
ca_es: Longitud màxima de fragments de línia abans de condensar

source: Running current script in terminal
ca_es: Executa l’script actual al terminal del sistema

source: Present Python REPL after program ends
ca_es: Continuar amb el REPL de Python després de la finalització del programa

source: Keep terminal window open after Python process ends
ca_es: Mantén oberta la finestra del terminal després de finalitzar el procés de Python

source: NB! Automatic closing needs to be enabled in Terminal's settings (Profiles → Shell → When the shell exits)
ca_es: NB! Cal habilitar el tancament automàtic a la configuració del Terminal (Eines → Opcions → Terminal)

source: UI theme
ca_es: Tema de la interfície d'usuari

source: Syntax theme
ca_es: Tema de sintaxi

source: Editor font
ca_es: Tipus de lletra de l'editor

source: IO font
ca_es: Tipus de lletra Entrada/Sortida

source: Preview
ca_es: Previsualització

source: This is a comment
ca_es: Això és un comentari

source: The answer is
ca_es: La resposta és

source: unclosed_string
ca_es: cadena_sense tancar

source: blah, blah
ca_es: bla, bla

source: NB! Some style elements change only after restarting turcar!
ca_es: NB! Alguns elements d'estil només canvien després de reiniciar turcar!

source: Enter an integer
ca_es: Introdueix un enter

source: Theme & Font
ca_es: Tema i Lletra

source: Open turcar program folder...
ca_es: Obre el directori del programa turcar...

source: Open turcar data folder...
ca_es: Obre el directori de dades de turcar...

source: Home
ca_es: Inici

source: Help contents
ca_es: Contingut de l'ajuda

source: CircuitPython device
ca_es: Dispositiu CircuitPython

source: MicroPython device
ca_es: Dispositiu MicroPython

source: Connect your device to the computer and select corresponding port below
ca_es: Connecta el dispositiu a l'ordinador i selecciona el port corresponent a sota

source: look for your device name, "USB Serial" or "UART"
ca_es: cerca el nom del dispositiu, "USB Serial" o "UART"

source: If you can't find it, you may need to install proper USB driver first.
ca_es: Si no el pots trobar, és possible que primer hagis d'instal·lar el controlador USB adequat.

source: Try to detect port automatically
ca_es: Intenta detectar el port automàticament

source: MicroPython (generic)
ca_es: MicroPython (genèric)

source: Print...
ca_es: Imprimeix...

source: Open system shell...
ca_es: Obre l'intèrpret d'ordres del sistema...

source: Details
ca_es: Detalls

source: Install from requirements file
ca_es: Instal·la des del fitxer de requisits

source: Install from local file
ca_es: Instal·la des d'un fitxer local

source: This dialog is for managing turcar plug-ins and their dependencies. If you want to install packages for your own programs then choose 'Tools → Manage packages...'
ca_es: Aquest diàleg és per a gestionar els plug-ins de turcar i les seves dependències. Si vols instal·lar paquets per als teus propis programes, tria 'Eines → Gestiona els paquets...'

source: CircuitPython (generic)
ca_es: CircuitPython (genèric)

source: Indent selected lines
ca_es: Indenta les línies seleccionades

source: Dedent selected lines
ca_es: Des-indenta les línies seleccionades

source: Switch to regular mode
ca_es: Canvia a mode normal

source: Make sure MicroPython has been installed to your micro:bit.
ca_es: Assegura't que el MicroPython s'ha instal·lat a la vostra micro:bit.

source: Don't forget that main.py only works without embedded main script.
ca_es: No oblidis que «main.py» només funciona sense un script principal incrustat.

source: Could not find disk '%s'. Do you want to locate it yourself?
ca_es: No s'ha pogut trobar el disc '%s'. Vols localitzar-lo tu mateix?

source: Found several '%s' disks. Do you want to choose one yourself?
ca_es: S'han trobat diversos discs '%s'. Vols triar-ne un tu mateix?

source: Can't find suitable disk
ca_es: No es pot trobar el disc adequat

source: %d items
ca_es: %d ítems

source: Move to Trash
ca_es: Mou a la paperera

source: Delete
ca_es: Esborra

source: New directory
ca_es: Nou directori

source: Properties
ca_es: Propietats

source: Storage space
ca_es: Espai d'emmagatzematge

source: Path
ca_es: Camí

source: Directory properties
ca_es: Propietat dels directoris

source: File properties
ca_es: Propietats del fitxers

source: Size
ca_es: Mida

source: Modified
ca_es: Modificat

source: Deleting %s
ca_es: Esborrat %s

source: Loading
ca_es: Carregant

source: Saving
ca_es: Desant

source: Upload to %s
ca_es: Pujat a %s

source: Downloading %s to %s
ca_es: Descarregant %s a %s

source: Download to %s
ca_es: Descarregat a %s

source: Open in system file manager
ca_es: Obre al gestor de fitxers del sistema

source: Hide hidden files
ca_es: Amaga els fitxers ocults

source: Show hidden files
ca_es: Mostra els fitxers ocults

source: Open in turcar
ca_es: Obre en el turcar

source: Open in system default app
ca_es: Obre a l'aplicació predeterminada del sistema

source: Configure %s files
ca_es: Configura %s fitxers

source: What to do with a %s file when you double-click it in turcar's file browser?
ca_es: Què fer amb un fitxer %s quan facis doble clic al navegador de fitxers de turcar?

source: Deleting
ca_es: Esborrant

source: Creating directory
ca_es: Creant directory

source: Loading %s
ca_es: Carregant %s

source: Saving to %s
ca_es: Desant a %s

source: Save All files
ca_es: Desa tots els fitxers

source: Configure interpreter...
ca_es: Configura l'intèrpret...

source: Device
ca_es: Dispositiu

source: Cancelling
ca_es: Cancel·lant

source: Starting
ca_es: Iniciant

source: Authentication
ca_es: Autenticació

source: Enter the passphrase of your private key for {}
ca_es: Introdueix la contrasenya de la teva clau privada per a {}

source: Enter your password for {}
ca_es: Introdueix la teva contrasenya per a {}

source: The representation above is an approximate value of this float. The exact stored value is %s which is about %s
ca_es: La representació anterior és un valor aproximat d'aquest 'float'. El valor exacte emmagatzemat és %s que és aproximadament %s

source: Search results
ca_es: Resultats de la cerca

source: Searching
ca_es: Cercant

source: Installing '%s'
ca_es: Instal·lant '%s'

source: Upgrading '%s'
ca_es: Actualitzant '%s'

source: Uninstalling '%s'
ca_es: S'està desinstal·lant '%s'

source: Installing
ca_es: Instal·lant

source: Package manager is not available for this interpreter
ca_es: El gestor de paquets no està disponible per a aquest intèrpret
