tap "getsentry/tools"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "glib"
brew "atk"
brew "automake"
brew "libffi"
brew "pcre"
brew "sqlite"
brew "python@3.9"
brew "cairo"
brew "carthage"
brew "cmake"
brew "cmu-sphinxbase"
brew "docker", link: false
brew "docker-machine"
brew "libtool"
brew "guile"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "ffmpeg"
brew "gcc"
brew "gdk-pixbuf"
brew "git"
brew "git-lfs"
brew "gobject-introspection"
brew "gsettings-desktop-schemas"
brew "pango"
brew "gtk+3"
brew "mint"
brew "mosquitto", restart_service: true
brew "node"
brew "openal-soft"
brew "portaudio"
brew "py3cairo"
brew "pygobject3"
brew "python@3.8"
brew "ruby"
brew "sox"
brew "subversion"
brew "swig"
brew "telnet"
brew "uwsgi", restart_service: true
brew "vorbis-tools"
brew "wget"
brew "xcodegen"
brew "xmlstarlet"
brew "yarn"
brew "zsh"
brew "getsentry/tools/sentry-cli"
brew "heroku/brew/heroku"
cask "kdiff3"
cask "mqttx"
