Repository: pypi-data/pypi-mirror-248
Catalog: packages/turcar/turcar-0.0.90.tar.gz/turcar-0.0.90/turcar/locale/*/LC_MESSAGES/thonny.po
Languages: fr_fr

source: Enter the passphrase of your private key for {}
fr_fr: Entrer la phrase de passe de votre clé privée pour {}

source: Enter your password for {}
fr_fr: Entrer votre mot de passe pour {}

source: The representation above is an approximate value of this float. The exact stored value is %s which is about %s
fr_fr: La représentation ci-dessus est une valeur approximative de ce décimal. La valeur exacte stockée est %s qui est environ %s

source: Search results
fr_fr: Résultats de la recherche

source: Searching
fr_fr: Chercher

source: Installing '%s'
fr_fr: Installation '%s'

source: Upgrading '%s'
fr_fr: Mise à jour '%s'

source: Uninstalling '%s'
fr_fr: Désinstallation '%s'

source: Installing
fr_fr: Installation

source: Package manager is not available for this interpreter
fr_fr: Pas de gestionnaire de package disponible pour cet interpréteur

source: Not supported
fr_fr: Non supporté

source: Not available
fr_fr: Non disponible

source: You need to stop your program before launching the package manager.
fr_fr: Vous devez arrêter vôtre programme avant de lancer le gestionnaire de package.

source: Open evaluated values in Object inspector
fr_fr: Ouvrir les valeurs évalués dans l'inspecteur d'objets

source: Python executable
fr_fr: Exécutable Python

source: NB! File selection button may not work properly when selecting executables from a virtual environment. In this case choose the 'activate' script instead of the interpreter (or enter the path directly to the box)!
fr_fr: Nb! Le button de sélection de fichiers pourrait ne pas pas fonctionner correctement en choisissant un exécutable issue d'un environnement virtuel. Dans ce cas choisissez 'activer' le script au lieu de l'interpréteur (ou entrer directement le chemin dans le champ)

source: Remote Python 3 (SSH)
fr_fr: Python3 distant (SSH)

source: Not connected
fr_fr: Non connecté

source: no absolute lib directory in sys.path
fr_fr: pas de répertoire lib absolu dans sys.path

source: Search on PyPI
fr_fr: Rechercher sur PyPI

source: Open in turcar's text editor
fr_fr: Ouvrir dans l'éditeur de texte de turcar

source: Storage space on this drive or filesystem
fr_fr: Espace disque sur ce disque ou système de fichiers

source: total space
fr_fr: espace total

source: used space
fr_fr: espace utilisé

source: free space
fr_fr: espace libre

source: Storage info
fr_fr: Informations sur le stockage

source: Replace tabs with spaces
fr_fr: Remplacer les tabulations par des espaces

source: Highlight tab characters
fr_fr: Mettre en surbrillance les tabulations

source: Indent with tab characters (not recommended for Python)
fr_fr: Indenter avec des tabulations (non recommandé pour Python)

source: Name
fr_fr: Nom

source: Size (bytes)
fr_fr: Taille (octets)

source: Enter name for new directory under %s
fr_fr: Entrez un nom pour le nouveau dossier dans %s

source: Nothing selected
fr_fr: Pas de sélection

source: Select an item and try again!
fr_fr: Sélectionnez un élément et réessayez !

source: Open from %s
fr_fr: Ouvrir à partir de %s

source: Save to %s
fr_fr: Enregistrer sous %s

source: File name:
fr_fr: Nom de fichier :

source: Value ID
fr_fr: ID de la valeur

source: Value
fr_fr: Valeur

source: Save password
fr_fr: Sauvegarder le mot de passe

source: Function call at %s
fr_fr: Appel de fonction à %s

source: Local variables
fr_fr: Variables locales

source: Function
fr_fr: Fonction

source: Location
fr_fr: Emplacement

source: If last command raised an exception then this view will show the stacktrace.
fr_fr: Si la dernière commande lève une exception cette fenêtre affichera le stacktrace

source: Data
fr_fr: Donnée

source: Attributes
fr_fr: Attributs

source: Key ID
fr_fr: Identifiant de clé

source: Key
fr_fr: Clé

source: Back to %s
fr_fr: Retour vers %s

source: Port or WebREPL
fr_fr: Port ou WebREPL

source: Password
fr_fr: mot de passe

source: Source code
fr_fr: Code source

source: Use Tk file dialogs instead of Zenity
fr_fr: Utiliser les boîtes de dialogue fichier de Tk au lieu de Zenity

source: Select if the file dialogs end up behind the main window
fr_fr: Boîtes de dialogue de fichier derrière la fenêtre principale

source: Environment variables (one KEY=VALUE per line)
fr_fr: Variables d'environnement (une paire clé=valeur par ligne)

source: New file
fr_fr: Fichier nouveau

source: Rename
fr_fr: Renommer

source: Rename '%s'
fr_fr: Renommer '%s'

source: Enter new name
fr_fr: Saisissez un nouveau nom

source: Paste failed
fr_fr: coller échoue

source: There are conflicting folders
fr_fr: Il y a des dossiers en conflit

source: File already exists
fr_fr: Fichier existe déjà

source: If it is a text file, then you can configure it to open in turcar by right-clicking it and selecting 'Configure ... files'.
fr_fr: S'il s'agit d'un fichier texte, vous pouvez le configurer pour qu'il s'ouvre dans turcar en cliquant avec le bouton droit de la souris et en sélectionnant « Configurer ... fichiers ».

source: Python files
fr_fr: Fichiers Python

source: <untitled>
fr_fr: <sans nom>

source: File is gone
fr_fr: Le fichier a disparu.

source: Do you want to also close the editor?
fr_fr: Voulez-vous fermer l'éditeur ?

source: External modification
fr_fr: modification externe

source: Do you want to discard current editor content and reload the file from disk?
fr_fr: Voulez-vous rejeter le contenu actuel de l'éditeur et relire le fichier à partir du disque ?

source: Python files usually have .py extension.
fr_fr: Habituellement, les fichiers Python utilisent .py comme extension.

source: Did you mean '%s'?
fr_fr: Voulez-vous dire '%s'?

source: Move / rename...
fr_fr: déplacer / renommer

source: Go to line...
fr_fr: Accéder à la ligne...

source: Line number
fr_fr: Numéro de ligne

source: Do you want to save files before closing?
fr_fr: Voulez-vous enregistrer les fichiers avant de les fermer ?

source: Do you want to save file before closing?
fr_fr: Voulez-vous enregistrer le fichier avant de le fermer ?

source: Save On Close
fr_fr: Enregistrer à la fermeture

source: Command not available
fr_fr: Commande indisponible

source: This command is not available if turcar is run via Flatpak
fr_fr: Cette commande n'est pas disponible si turcar est exécuté via Flatpak.

source: Support Ukraine
fr_fr: Soutenez l'Ukraine

source: Which kind of interpreter should turcar use for running your code?
fr_fr: Quel type d'interpréteur turcar doit-il utiliser pour exécuter votre code ?

source: Show parameter info
fr_fr: Afficher l'information sur les paramètres

source: Automatically show parameter info after typing '('
fr_fr: Afficher automatiquement les informations sur les paramètres après avoir tapé '('

source: Automatically propose completions while typing
fr_fr: Proposer automatiquement des compléments pendant la saisie

source: Automatically show documentation for completions
fr_fr: Afficher automatiquement la documentation pour les compléments

source: Request completions with Tab-key in editors
fr_fr: Demander des compléments avec la touche Tab dans les éditeurs

source: Request completions with Tab-key in Shell
fr_fr: Demander des compléments avec la touche Tab dans le shell

source: Problem
fr_fr: problème

source: Could not find definition
fr_fr: Impossible de trouver une définition

source: Clear Shell before starting new process (Run, Debug, Stop/Restart, ...)
fr_fr: Vider la console avant de lancer un processus nouveau (exécuter, débouger, arrêter/redémarrer, ...)

source: turcar's Python
fr_fr: Python de turcar

source: Interrupt working program on connect
fr_fr: Interrompre l'exécution du programme dès la connexion

source: Synchronize device's real time clock
fr_fr: Synchroniser l'horloge en temps réel d'outil

source: Use local time in real time clock
fr_fr: Utiliser l'heure locale pour l'horloge en temps réel

source: Restart interpreter before running a script
fr_fr: redémarrer l'interpréteur avant exécuter le script

source: This doesn't look like MicroPython/CircuitPython package. Are you sure you want to install it?
fr_fr: Cela ne ressemble pas au paquet MicroPython/CircuitPython. Êtes-vous sûr de vouloir l'installer ?

source: Moving to Trash
fr_fr: Déplacer vers la corbeille

source: Move %s to Trash?
fr_fr: Déplacer %s vers la corbeille ?

source: Moving %s to Trash
fr_fr: Déplacement de %s vers la corbeille

source: Open in default external app
fr_fr: Ouvrir dans l'application externe par défaut

source: Opening remote files in external app is not supported.
fr_fr: L'ouverture de fichiers distants dans une application externe n'est pas prise en charge.

source: If the file needs to be opened in external app, then download it to a local directory and open it from there!
fr_fr: Si le fichier doit être ouvert dans une application externe, téléchargez-le dans un répertoire local et ouvrez-le de là !

source: Looks like '%s' was deleted or moved.
fr_fr: Il semble que '%s' ait été supprimé ou déplacé.

source: Looks like '%s' was modified outside of the editor.
fr_fr: Il semble que '%s' ait été modifié en dehors de l'éditeur.

source: NB! turcar only supports Python %s and later
fr_fr: Note, turcar ne prend en charge que Python %s et les versions ultérieures

source: Go to line
fr_fr: Accéder à la ligne

source: Support
fr_fr: support technique

source: Could not save
fr_fr: impossible de l’enregistrer

source: Warning
fr_fr: Avertissement

source: If you quote the value of an environment variable, the quotes will be part of the value. Did you intend this?
fr_fr: Si vous citez la valeur d'une variable d'environnement, les guillemets feront partie de la valeur. C'était votre intention ?

source: Install MicroPython
fr_fr: installer MicroPython

source: Install CircuitPython
fr_fr: installer CicuitPython

source: Make uploaded shebang scripts executable
fr_fr: Rendre les scripts shebang téléchargés exécutables

source: Make saved shebang scripts executable
fr_fr: Rendre les scripts shebang sauvegardés exécutables

source: Activate virtual environment
fr_fr: activer l'environnement virtuel

source: Target
fr_fr: cible

source: Visualize current script at Python Tutor
fr_fr: visualizer le script curant au Python Tutor

source: Line
fr_fr: ligne

source: No line marked with #todo found
fr_fr: Aucune ligne n'est marquée par #todo

source: Install or update %s
fr_fr: Installer ou mettre à jour %s

source: Local Python 3
fr_fr: Python 3 local

source: You can activate an existing virtual environment also via the right-click context menu in the file navagation when selecting a virtual environment folder, or the 'pyveng.cfg' file inside.
fr_fr: Vous pouvez également activer un environnement virtuel existant via le menu contextuel du clic droit dans la navigation des fichiers lorsque vous sélectionnez un dossier d'environnement virtuel ou le fichier 'pyveng.cfg' qu'il contient.

source: Preparations (skip the VS Code part)
fr_fr: Les préperations (omettre la partie VS Code)

source: Default password
fr_fr: Mot de passe par défaut

source: For debugging the program must be saved first.
fr_fr: Enregistrez le script avant de le déboguer.

source: %s doesn't look like a text file
fr_fr: '%s' ne semble pas être un fichier texte

source: Problem loading file
fr_fr: Problème de chargement de fichier

source: This file seems to have problems with encoding. Make sure it is in UTF-8 or contains proper encoding hint.
fr_fr: Le fichier semble être mal encodé. Vérifier qu'il est encodé en UTF-8 ou que l'encoding est clairement indiqué dans le fichier.

source: File is open
fr_fr: Le fichier est ouvert

source: This file is already open in turcar. If you want to save with this name, close the existing editor first!
fr_fr: Un fichier du même nom est déjà ouvert dans turcar. Si vous voulez l'enregistrer avec ce nom, fermer d'abord l'éditeur correspondant !

source: Permission Error
fr_fr: Accès non autorisé

source: Looks like this file or folder is not writable.
fr_fr: Impossible d'écrire dans le fichier ou le dossier sélectionné.

source: Back-end is not ready
fr_fr: La backend n'est pas prête

source: Where to save to?
fr_fr: Où enregister ?

source: Potential problem
fr_fr: Potentiel problème

source: If you name your script '%s', you won't be able to import the library module named '%s'
fr_fr: Si vous nommez votre script '%s', vous ne serez pas en mesure d'importer le module '%s'

source: Do you still want to use this name for your script?
fr_fr: Êtes-vous sûr de vouloir utiliser ce nom de fichier pour votre script ?

source: Got permission error when trying to load %s
fr_fr: Accès non autorisé pendant le chargement %s

source: Try opening it with File => Open.
fr_fr: Essayer de l'ouvrir avec Fichier => Ouvrir.

source: Permission error
fr_fr: Accès non autorisé

source: Allow running unnamed programs
fr_fr: Autoriser l'exécution de programme pas enregistré.

source: License
fr_fr: Licence

source: Warn if a user module shadows a library module
fr_fr: Avertir si un module personnalisé rend un module de bibliothèque inaccessible

source: Search micropython-lib and PyPI
fr_fr: Chercher micropython-lib et PyPI
