Repository: pypi-data/pypi-mirror-248
Catalog: packages/turcar/turcar-0.0.90.tar.gz/turcar-0.0.90/turcar/locale/*/LC_MESSAGES/thonny.po
Languages: fr_fr

source: File
fr_fr: Fichier

source: Edit
fr_fr: Édition

source: View
fr_fr: Affichage

source: Run
fr_fr: Exécuter

source: Tools
fr_fr: Outils

source: Help
fr_fr: Aide

source: Exit
fr_fr: Quitter

source: Decrease font size
fr_fr: Diminuer la taille de la police

source: Focus editor
fr_fr: Placer le curseur dans l'éditeur

source: Focus shell
fr_fr: Placer le curseur dans la console

source: Maximize view
fr_fr: Agrandir la vue

source: Full screen
fr_fr: Plein écran

source: Program arguments
fr_fr: Arguments du programme

source: About turcar
fr_fr: À propos de turcar

source: Made in University of Tartu, Estonia, with the help from open-source community, Raspberry Pi Foundation and Cybernetica AS
fr_fr: Programmé à l'Université de Tartu, Estonie, avec l'aide de la communauté open-source, de la Fondation Raspberry Pi et de Cybernetica SAS

source: This program comes with ABSOLUTELY NO WARRANTY! It is free software, and you are welcome to redistribute it under certain conditions, see https://opensource.org/licenses/MIT for details
fr_fr: Ce programme n'est fourni SANS AUCUNE GARANTIE QUELLE QU'ELLE SOIT ! Il s'agit d'un logiciel libre et vous pouvez le redistribuer sous certaines conditions, voir https://opensource.org/licenses/MIT pour plus de détails

source: Version history
fr_fr: Historique de version

source: Report problems
fr_fr: Signaler un problème

source: Open Assistant automatically when program crashes with an exception
fr_fr: Ouvrir automatiquement l’assistant lorsqu’un programme plante avec une exception

source: Open Assistant automatically when it has warnings for your code
fr_fr: Ouvrir l’assistant automatiquement lorsqu'il y a des avertissements pour votre code

source: Perform selected Pylint checks
fr_fr: Effectuer les vérifications Pylint sélectionnées

source: Perform MyPy checks
fr_fr: Effectuer les vérifications MyPy

source: Disabled checks (one id per line)
fr_fr: Vérifications désactivées (un identifiant par ligne)

source: Auto-complete
fr_fr: Auto-complétion

source: Interpreter
fr_fr: Interpréteur

source: About Birdseye
fr_fr: À propos de Birdseye

source: Birdseye is a Python debugger which needs to be installed separately. Do you want to open the help page and learn more?
fr_fr: Birdseye est un débogueur Python qui doit être installé séparément. Voulez-vous ouvrir l’aide pour en savoir plus ?

source: Debug current script (birdseye)
fr_fr: Déboguer le script courant (birdseye)

source: Toggle comment
fr_fr: Commenter/Décommenter

source: Comment out
fr_fr: Commenter

source: Uncomment
fr_fr: Décommenter

source: Undo
fr_fr: Défaire

source: Redo
fr_fr: Rétablir

source: Cut
fr_fr: Couper

source: Copy
fr_fr: Copier

source: Paste
fr_fr: Coller

source: Select all
fr_fr: Tout sélectionner

source: Run to cursor
fr_fr: Exécuter jusqu'au curseur

source: Can't close yet
fr_fr: Impossible de fermer pour l'instant

source: Use "Stop" command if you want to cancel debugging
fr_fr: Utilisez la commande « Stop » pour annuler le débogage

source: Dock user windows
fr_fr: Ancrer les fenêtres de l'utilisateur

source: Highlight matching names
fr_fr: Surligner les noms correspondants

source: Highlight local variables
fr_fr: Surligner les variables locales

source: Highlight parentheses
fr_fr: Surligner les parenthèses

source: Highlight syntax elements
fr_fr: Surligner les éléments de syntaxe

source: Highlight current line (requires reopening the editor)
fr_fr: Surligner la ligne du curseur (nécessite de ré-ouvrir l'éditeur)

source: Show line numbers
fr_fr: Afficher les numéros de ligne

source: Recommended maximum line length (Set to 0 to turn off margin line)
fr_fr: Longueur maximale de ligne recommandée (définir à 0 pour désactiver la limite)

source: Editor
fr_fr: Éditeur

source: Export usage logs...
fr_fr: Exporter les journaux d’utilisation…

source: Events
fr_fr: Événements

source: Files
fr_fr: Fichiers

source: Find & Replace
fr_fr: Rechercher et remplacer

source: Find:
fr_fr: Rechercher :

source: Replace with:
fr_fr: Remplacer par :

source: Case sensitive
fr_fr: Sensible à la casse

source: Up
fr_fr: Précédent

source: Down
fr_fr: Suivant

source: Find
fr_fr: Rechercher

source: Replace
fr_fr: Remplacer

source: Replace+Find
fr_fr: Remplacer et rechercher

source: Replace all
fr_fr: Remplacer tout

source: Enter string to be replaced.
fr_fr: Entrez le texte à remplacer.

source: The specified text was not found!
fr_fr: Le texte spécifié n'a pas été trouvé !

source: Allow only single turcar instance
fr_fr: N'autoriser qu'une seule instance de turcar

source: Reopen all files from previous session
fr_fr: Réouvrir tous les fichiers de la session précédente

source: Disable notification sound
fr_fr: Désactiver les sons de notification

source: Font scaling mode
fr_fr: Mode de mise à l'échelle de la police

source: Heap mode is on. Close Heap view to turn it off.
fr_fr: Le suivi des allocations mémoire est activé. Fermez-le pour le désactiver.

source: Heap
fr_fr: Allocations mémoire

source: Language
fr_fr: Langue

source: This box is meant for your working notes -- assignment instructions, code snippets, whatever. Everything will be saved automatically and loaded when you open turcar next time. Feel free to delete this text to make room for your own notes.
fr_fr: Cette section est prévue pour vos notes de travail : instructions d’affectation, fragments de code, ce que vous voulez. Tout sera sauvegardé automatiquement et chargé lorsque vous ouvrirez turcar la prochaine fois. N’hésitez pas à effacer ce texte pour faire de la place pour vos propres notes.

source: Previous object
fr_fr: Objet précédent

source: Next object
fr_fr: Objet suivant

source: Object inspector
fr_fr: Inspecteur d'objet

source: Outline
fr_fr: Structure

source: Pygame Zero mode
fr_fr: Mode Pygame Zero

source: Uninstall
fr_fr: Désinstaller

source: Close
fr_fr: Fermer

source: Click
fr_fr: Cliquez

source: here
fr_fr: ici

source: Upgrade
fr_fr: Mettre à jour

source: Install
fr_fr: Installer

source: Could not find the package from PyPI.
fr_fr: Impossible de trouver le paquet dans PyPi.

source: Latest stable version
fr_fr: Dernière version stable

source: Latest version
fr_fr: Dernière version

source: Summary
fr_fr: Résumé

source: Author
fr_fr: Auteur

source: Homepage
fr_fr: Page d'accueil

source: Bugtracker
fr_fr: Suivi des bogues

source: PyPI page
fr_fr: Page PyPI

source: Requires
fr_fr: Nécessite

source: Really uninstall?
fr_fr: Voulez-vous vraiment désinstaller ?

source: Are you sure you want to uninstall it?
fr_fr: Êtes-vous sur de vouloir le désinstaller ?

source: Back to current frame
fr_fr: Revenir au cadre courant

source: This computer
fr_fr: Cet ordinateur

source: Refresh
fr_fr: Actualiser

source: Focus into
fr_fr: Placer le curseur dans

source: Error
fr_fr: Erreur

source: You need to select a file!
fr_fr: Vous devez sélectionner un fichier !

source: Overwrite?
fr_fr: Écraser ?

source: Do you want to overwrite '%s' ?
fr_fr: Voulez-vous écraser '%s' ?

source: New
fr_fr: Nouveau

source: Open...
fr_fr: Ouvrir…

source: Load
fr_fr: Charger

source: Recent files
fr_fr: Fichiers récents

source: Close all
fr_fr: Tout fermer

source: Save
fr_fr: Enregistrer

source: Save as...
fr_fr: Enregistrer sous…

source: Save copy...
fr_fr: Enregistrer une copie…

source: turcar options
fr_fr: Options de turcar

source: Run current script
fr_fr: Exécuter le script courant

source: Run current script in terminal
fr_fr: Exécuter le script courant dans un terminal

source: Stop/Restart backend
fr_fr: Arrêter/redémarrer l’interpréteur

source: Stop
fr_fr: Arrêter

source: Interrupt execution
fr_fr: Interrompre l’exécution

source: Send EOF / Soft reboot
fr_fr: Envoyer le symbole EOF / Redémarrer

source: Disconnect
fr_fr: Déconnecter

source: Python interpreters
fr_fr: Interpréteurs Python

source: all files
fr_fr: tous les fichiers

source: Select empty directory for new virtual environment
fr_fr: Sélectionner un dossier vide pour le nouvel environnement virtuel

source: Bad directory
fr_fr: Dossier invalide

source: Selected directory is not empty. Select another or cancel.
fr_fr: Le dossier sélectionné n'est pas vide. Sélectionner un autre ou annuler.

source: Creating virtual environment
fr_fr: Création de l'environnement virtuel

source: Clear shell
fr_fr: Vider la console

source: Plotter
fr_fr: Grapheur

source: Clear
fr_fr: Effacer

source: Show Plotter
fr_fr: Afficher le Grapheur

source: For performance reasons, Shell avoids showing very long lines in full (see Tools => Options => Shell). Here you can interact with the original text fragment.
fr_fr: Pour des raisons de performance, la console évite d'afficher les très longues lignes en entier (voir Outils => Options => Console). Vous pouvez interagir ici avec le texte original.

source: Wrap text (may be slow)
fr_fr: Enrouler le texte (peut être lent)

source: Copy to clipboard
fr_fr: Copier dans le presse-papiers

source: Squeezed text (%d characters)
fr_fr: Texte tronqué (%d caractères)

source: Plotter visualizes series of numbers printed to the Shell.
fr_fr: Le Grapheur rend visuelles des séries de nombres affichées dans le Shell.

source: See Help for details.
fr_fr: Voir l'aide pour des détails.

source: Close others
fr_fr: Fermer les autres

source: Copying
fr_fr: Copie

source: Copying %s to %s
fr_fr: Copie de %s vers %s

source: Cancel
fr_fr: Annuler

source: Select All
fr_fr: Sélectionner tout

source: Shell
fr_fr: Console

source: Increase font size
fr_fr: Augmenter la taille de la police

source: Change font size
fr_fr: Modifier la taille de la police

source: Exit turcar
fr_fr: Quitter turcar

source: Quit
fr_fr: Quitter

source: Overwriting theme '%s'
fr_fr: Remplacement du thème '%s'

source: Program arguments:
fr_fr: Arguments du programme :

source: Regular mode
fr_fr: Mode normal

source: Configuration has been updated. Restart turcar to start working in regular mode. (See 'Tools → Options → General' if you change your mind later.)
fr_fr: La configuration a été mise à jour. Redémarrez turcar pour commencer à travailler en mode normal. (Voir « Outils → Options → Général » si vous changez d'avis plus tard.)

source: Program tree
fr_fr: Arbre du programme

source: Resume
fr_fr: Reprendre

source: Run / resume
fr_fr: Exécuter / reprendre

source: Debug current script
fr_fr: Déboguer le script courant

source: Debug
fr_fr: Déboguer

source: Debug current script (nicer)
fr_fr: Déboguer le script courant (plus joli)

source: Debug current script (faster)
fr_fr: Déboguer le script courant (plus rapide)

source: Step over
fr_fr: Étape suivante

source: Over
fr_fr: Suivant

source: Step into
fr_fr: Entrer dans l'étape en cours

source: Into
fr_fr: Entrer

source: Step out
fr_fr: Sortir de l'étape en cours

source: Out
fr_fr: Sortir

source: Step back
fr_fr: Étape précédente

source: Back
fr_fr: Précédent

source: Stack
fr_fr: Pile

source: Log program usage events
fr_fr: Journaliser les évènements d'utilisation du programme

source: Debug mode (provides more detailed diagnostic logs)
fr_fr: Mode de débogage (fournit des journaux de diagnostic plus détaillés)

source: UI mode
fr_fr: Type d'interface

source: UI scaling factor
fr_fr: Facteur d'échelle de l'interface

source: NB! Restart turcar after changing these options!
fr_fr: Remarque : Redémarrez turcar après avoir modifié ces options !

source: General
fr_fr: Général

source: INSTALL
fr_fr: INSTALLER

source: Browse the packages
fr_fr: Parcourir les paquets

source: With current interpreter you can only browse the packages here. Use 'Tools → Open system shell...' for installing, upgrading or uninstalling.
fr_fr: Avec l'interpréteur courant vous ne pouvez parcourir que ces paquets. Utilisez « Outils → Ouvrir la console du système… » pour installer, mettre à jour ou désinstaller.

source: Packages' directory
fr_fr: Dossier des paquets

source: Install from PyPI
fr_fr: Installer depuis PyPI

source: If you don't know where to get the package from, then most likely you'll want to search the Python Package Index. Start by entering the name of the package in the search box above and pressing ENTER.
fr_fr: Si vous ne savez pas d'où vous pouvez obtenir le paquet, alors vous pouvez faire une recherche dans l'Index des Paquets Python. Commencez par entrer le nom du paquet dans le champ de recherche ci-dessus et appuyez sur ENTRÉE.

source: to locate requirements.txt file and install the packages specified in it.
fr_fr: pour trouver le fichier requirements.txt et installer les paquets qui y sont spécifiés.

source: Click
fr_fr: Cliquez

source: to locate and install the package file (usually with .whl, .tar.gz or .zip extension).
fr_fr: pour trouver et installer le fichier du paquet (généralement avec l'extension .whl, .tar.gz ou .zip).

source: Upgrade or uninstall
fr_fr: Mettre à jour ou désinstaller

source: Start by selecting the package from the left.
fr_fr: Commencez par sélectionner le paquet sur la gauche.

source: This dialog lists all available packages, but allows upgrading and uninstalling only packages from
fr_fr: Cette boîte de dialogue liste tous les paquets disponibles, mais n'autorise la mise à jour et la désinstallation que depuis

source: New packages will be also installed into this directory. Other locations must be managed by alternative means.
fr_fr: Les nouveaux paquets seront également installés dans ce dossier. D'autres emplacements peuvent être gérés de façon différente.

source: Installed version:
fr_fr: Version installée :

source: Installed to:
fr_fr: Installée dans :

source: Please check your spelling!
fr_fr: Veuillez vérifier la syntaxe !

source: Could not find the package info from PyPI.
fr_fr: Impossible de trouver le paquet dans PyPI

source: Error code:
fr_fr: Code d'erreur :

source: Can't find package name from the list:
fr_fr: Impossible de trouver le nom du paquet dans la liste :

source: Package '{}' is required for installing and uninstalling other packages.
fr_fr: Le paquet '{}' est nécessaire pour installer ou désinstaller d'autres paquets.

source: Package
fr_fr: Paquet

source: Manage packages for %s
fr_fr: Gérer les paquets pour %s

source: Looks like you are installing a turcar-related package. If you meant to install a turcar plugin, then you should choose 'Tools → Manage plugins...' instead Are you sure you want to install %s for the back-end?
fr_fr: Il semble que vous êtes en train d'installer un paquet lié à turcar. Si vous vouliez installer un plugin de turcar, alors vous devriez plutôt sélectionner « Outils → Gérer les plugins… » Êtes-vous sûr de vouloir installer %s pour l'interpréteur ?

source: NB! There may be another version available which is compatible with current turcar version. Click on '...' button to choose the version to install.
fr_fr: Remarque : Il est possible qu'il y ait une autre version disponible qui soit compatible avec la version actuelle de turcar. Cliquez sur le bouton « … » pour sélectionner la version à installer.

source: turcar plugin without requirements
fr_fr: Plugin pour turcar sans aucun pré-requis

source: Unsuitable requirements
fr_fr: Exigences non satisfaites

source: This package requires different turcar version:
fr_fr: Ce paquet nécessite une version différente de turcar :

source: If you still want it, then please install it from the command line.
fr_fr: Si vous le voulez vraiment, veuillez l'installer en ligne de commande.

source: NB! You need to restart turcar after installing / upgrading / uninstalling a plug-in.
fr_fr: Remarque : Vous devez redémarrer turcar après avoir installé / mis à jour / désinstallé un plugin.

source: turcar plug-ins
fr_fr: Plugins de turcar

source: Advanced install / upgrade / downgrade
fr_fr: Installation / Mise à jour / Rétrogradation avancée

source: Desired version
fr_fr: Version souhaitée

source: Upgrade dependencies
fr_fr: Mettre à jour les dépendances

source: Requires:
fr_fr: Exigences :

source: Error:
fr_fr: Erreur :

source: Manage packages...
fr_fr: Gérer les paquets…

source: Manage plug-ins...
fr_fr: Gérer les plugins…

source: Change working directory to script directory on Run / Debug
fr_fr: Modifier le dossier de travail en dossier de script lors de l'exécution / débogage

source: Show function calls (frames) in separate windows
fr_fr: Afficher les appels de fonction (cadres) dans des fenêtres séparées

source: Uncheck if you want more traditional experience.
fr_fr: Décochez si vous souhaitez une expérience d'utilisation plus classique.

source: Open and close Stack view automatically
fr_fr: Ouvrir et fermer la vue de la pile automatiquement

source: Opens the Stack view on first call and closes it when program returns to main frame.
fr_fr: Ouvre la vue de la pile au premier appel et la ferme lorsque le programme revient au cadre principal.

source: Allow stepping into libraries (ie. outside of main script directory)
fr_fr: Autoriser l'entrée dans les bibliothèques en mode débogage (par ex. en dehors du dossier du script principal)

source: May make debugging slower.
fr_fr: Peut ralentir le débogueur.

source: Preferred debugger
fr_fr: Débogueur favori

source: (used when clicking Debug toolbar button)
fr_fr: (utilisé lors du clic sur le bouton Déboguer dans la barre d'outils)

source: Birdseye port
fr_fr: Port de Birdseye

source: (restart turcar after changing this)
fr_fr: (redémarrez turcar après avoir modifié ceci)

source: Run & Debug
fr_fr: Exécuter et déboguer

source: Terminal emulation
fr_fr: Émulation du terminal

source: supports basic ANSI-colors and styles
fr_fr: prend en charge les styles et les couleurs ANSI simples

source: Maximum number of lines to keep.
fr_fr: Nombre maximum de lignes à conserver.

source: NB! Large values may cause poor performance!
fr_fr: Remarque : De grandes valeurs peuvent réduire les performances !

source: Maximum length of line fragments before squeezing
fr_fr: Longueur maximum de ligne avant de tronquer le texte

source: Running current script in terminal
fr_fr: Exécution du script courant dans le terminal

source: Present Python REPL after program ends
fr_fr: Afficher Python REPL après la fin du programme

source: Keep terminal window open after Python process ends
fr_fr: Conserver la fenêtre du terminal ouverte après la fin du processus Python

source: NB! Automatic closing needs to be enabled in Terminal's settings (Profiles → Shell → When the shell exits)
fr_fr: Remarque : La fermeture automatique doit être activée dans les paramètres du terminal (Profils → Console → Lorsque la console se ferme)

source: UI theme
fr_fr: Thème de l'interface

source: Syntax theme
fr_fr: Thème de la syntaxe

source: Editor font
fr_fr: Police de l'éditeur

source: IO font
fr_fr: Police de la console

source: Preview
fr_fr: Aperçu

source: This is a comment
fr_fr: Ceci est un commentaire

source: The answer is
fr_fr: La réponse est

source: unclosed_string
fr_fr: chaîne_non_fermée

source: blah, blah
fr_fr: bla, bla

source: NB! Some style elements change only after restarting turcar!
fr_fr: Remarque : Certains éléments de style ne seront modifiés qu'après le redémarrage de turcar !

source: Enter an integer
fr_fr: Entrez un nombre entier

source: Theme & Font
fr_fr: Thème et police

source: Open turcar program folder...
fr_fr: Ouvrir le dossier programme de turcar…

source: Open turcar data folder...
fr_fr: Ouvrir le dossier de données de turcar…

source: Home
fr_fr: Accueil

source: Help contents
fr_fr: Contenu de l'aide

source: CircuitPython device
fr_fr: appareil CircuitPython

source: MicroPython device
fr_fr: appareil MicroPython

source: Connect your device to the computer and select corresponding port below
fr_fr: Connectez votre appareil à l'ordinateur et sélectionnez le port correspondant ci-dessous

source: look for your device name, "USB Serial" or "UART"
fr_fr: recherche du nom de votre appareil, « USB Serial » ou « UART »

source: If you can't find it, you may need to install proper USB driver first.
fr_fr: Si vous ne le trouvez pas, vous devriez d'abord installer un pilote USB correct.

source: Try to detect port automatically
fr_fr: Essayer de détecter le port automatiquement

source: MicroPython (generic)
fr_fr: MicroPython (générique)

source: Print...
fr_fr: Imprimer…

source: Open system shell...
fr_fr: Ouvrir la console du système…

source: Details
fr_fr: Détails

source: Install from requirements file
fr_fr: Installer depuis un fichier d'exigences

source: Install from local file
fr_fr: Installer depuis un fichier local

source: This dialog is for managing turcar plug-ins and their dependencies. If you want to install packages for your own programs then choose 'Tools → Manage packages...'
fr_fr: Cette boîte de dialogue concerne la gestion des plugins de turcar et leurs dépendances. Si vous souhaitez installer des paquets pour vos propres programmes, sélectionnez « Outils → Gérer les paquets… »

source: CircuitPython (generic)
fr_fr: CircuitPython (générique)

source: Indent selected lines
fr_fr: Indenter les lignes sélectionnées

source: Dedent selected lines
fr_fr: Désindenter les lignes sélectionnées

source: Switch to regular mode
fr_fr: Passer en mode normal

source: Make sure MicroPython has been installed to your micro:bit.
fr_fr: Veuillez vérifier que MicroPython a bien été installé dans votre micro:bit.

source: Don't forget that main.py only works without embedded main script.
fr_fr: N'oubliez pas que main.py ne peut fonctionner que sans script principal intégré.

source: Could not find disk '%s'. Do you want to locate it yourself?
fr_fr: Impossible de trouver le disque '%s'. Voulez-vous le trouver vous-même ?

source: Found several '%s' disks. Do you want to choose one yourself?
fr_fr: Plusieurs disques '%s' trouvés. Voulez-vous en sélectionner un vous-même ?

source: Can't find suitable disk
fr_fr: Impossible de trouver un disque valide

source: %d items
fr_fr: %d éléments

source: Move to Trash
fr_fr: Déplacer vers la corbeille

source: Delete
fr_fr: Supprimer

source: New directory
fr_fr: Nouveau dossier

source: Properties
fr_fr: Propriétés

source: Storage space
fr_fr: Espace de stockage

source: Path
fr_fr: Chemin

source: Directory properties
fr_fr: Propriétés du dossier

source: File properties
fr_fr: Propriétés du fichier

source: bytes
fr_fr: octets

source: Size
fr_fr: Taille

source: Modified
fr_fr: Modifié le

source: Deleting %s
fr_fr: Suppression de %s

source: Loading
fr_fr: Chargement

source: Saving
fr_fr: Enregistrement

source: Upload to %s
fr_fr: Téléversement vers %s

source: Downloading %s to %s
fr_fr: Téléchargement de %s vers %s

source: Download to %s
fr_fr: Téléchargement vers %s

source: Open in system file manager
fr_fr: Ouvrir dans le gestionnaire de fichiers

source: Hide hidden files
fr_fr: Cacher les fichiers cachés

source: Show hidden files
fr_fr: Montrer les fichiers cachés

source: Open in turcar
fr_fr: Ouvrir dans turcar

source: Open in system default app
fr_fr: Ouvrir dans l'application système par défaut

source: Configure %s files
fr_fr: Configurer les fichiers %s

source: What to do with a %s file when you double-click it in turcar's file browser?
fr_fr: Que faire avec un fichier %s quand vous double cliquez dessus dans le gestionnaire de fichier de turcar ?

source: Deleting
fr_fr: Supprimer

source: Creating directory
fr_fr: Créer le répertoire

source: Loading %s
fr_fr: Charger %s

source: Saving to %s
fr_fr: Sauvegarder dans %s

source: Save All files
fr_fr: Sauvegarder Tous les fichiers

source: Configure interpreter...
fr_fr: Configurer l'interpréteur...

source: Device
fr_fr: Appareil

source: Cancelling
fr_fr: Annuler

source: Starting
fr_fr: Démarrer

source: Authentication
fr_fr: Authentification
