import os.path


def rvs(number, search=0):
        sklad = {
0: """
import numpy as np
import pandas as pd
from scipy.stats import *

def convert(s):
    s = s.replace(',', '.').replace(';', ',')
    data = map(float, s.split(','))
    return list(data)

Z = norm()

def Phi0(x):
    return Z.cdf(x) - 1 / 2
""",
1:
"""
        Проверка гипотез о значении среднего, 1
Пусть X-> =(x1,…,x30)
 – реализация случайной выборки X-> =(X1,…,X30)
 из нормального распределения N(μ;3,42)
. Проверяется на уровне значимости α=0,01
 основная гипотеза H0:μ=1,29
 против альтернативной гипотезы H1:μ≠1,29
 с критическим множеством вида Kα=(−∞,−A)∪(A,+∞)
. 1) Найдите значение статистики критерия Zнабл.=Z(->)
. 2) Найдите границу А критического множества. 3) Найдите P
-значение критерия и сделайте выводы. 4) Найдите мощность W
 критерия для H1:μ=1,17
.
Исходные данные: X-> =
(1,416; 0,624; 6,471; 6,256; 1,787; 2,546; -1,758; -5,475; 0,077; 1,792; 5,443; 5,348; -0,057; 0,232; -2,305; -3,568; -4,541; 7,893; -0,473; -0,229; -3,0; 3,903; -4,227; 0,537; -1,785; 2,575; -0,477; -2,754; 1,164; 2,716).
!!!КОД:
x = convert('1,416; 0,624; 6,471; 6,256; 1,787; 2,546; -1,758; -5,475; 0,077; 1,792; 5,443; 5,348; -0,057; 0,232; -2,305; -3,568; -4,541; 7,893; -0,473; -0,229; -3,0; 3,903; -4,227; 0,537; -1,785; 2,575; -0,477; -2,754; 1,164; 2,716')
x = np.array(x)
n = len(x)

s = 3.4
alpha = 0.01
mu0 = 1.29
mu1 = 1.17

z = np.sqrt(n) * (x.mean() - mu0) / s

A = Z.isf(alpha / 2)

P = 2 * min(Z.cdf(z), Z.sf(z))

beta = Phi0(A - np.sqrt(n) * (mu1 - mu0) / s) + Phi0(A + np.sqrt(n) * (mu1 - mu0) / s)
W = 1 - beta

print(z)
print(A)
print(P)
print(W)
 """,
2:
"""
Проверка гипотез о значении среднего, 2
Пусть X-> =(x1,…,x20) – реализация случайной выборки X-> =(X1,…,X20) из нормального распределения N(μ;σ2). Проверяется на уровне значимости α=0,05 основная гипотеза H0:μ=1,10 против альтернативной гипотезы H1:μ≠1,10 с критическим множеством вида Kα=(−∞,−A)∪(A,+∞). 1) Найдите значение статистики критерия t=Tнабл.=T(x->). 2) Найдите границу А критического множества. 3) Найдите P-значение критерия и сделайте выводы. 4) Найдите мощность W критерия для H1:μ=0,91.Исходные данные: x⃗ = (1,146; 2,958; -3,325; -0,534; 0,374; 5,293; 0,12; 1,185; 5,148; 5,351; 2,639; 1,47; -1,967; 4,96; 6,057; -0,542; 1,544; -0,243; -1,988; 2,844).
 
!!! КОД:
x = convert('1,146; 2,958; -3,325; -0,534; 0,374; 5,293; 0,12; 1,185; 5,148; 5,351; 2,639; 1,47; -1,967; 4,96; 6,057; -0,542; 1,544; -0,243; -1,988; 2,844')
x = np.array(x)
n = x.shape[0]

alpha = 0.05
mu0 = 1.1
mu1 = 0.91

T = np.sqrt(n - 1) * (x.mean() - mu0) / x.std(ddof=0)

A = t(n - 1).isf(alpha / 2)

P = 2 * min(t(n - 1).cdf(T), t(n - 1).sf(T))

delta = np.sqrt(n - 1) * (mu1 - mu0) / x.std()
t2 = t(n - 1).isf(alpha / 2)

beta = nct(n - 1, delta).cdf(t2) - nct(n - 1, delta).cdf(-t2)
W = 1 - beta

print(T)
print(A)
print(P)
print(W)
""",
3:
"""
Проверка гипотез о значении дисперсии, 1
Пусть X-> =(x1,…,x30)
 – реализация случайной выборки X-> =(X1,…,X30)
 из нормального распределения N(1,18;σ2)
. Проверяется на уровне значимости α=0,02
 гипотеза H0:σ=1,14
 против альтернативной гипотезы H1:σ≠1,14
 с критическим множеством вида Kα=(0;A)∪(B;+∞)
. 1) Найдите значение статистики критерия χ20
. 2) Найдите границы А и В критического множества и проверьте гипотезу H0
. 3) Найдите P
-значение критерия. 4) Найдите вероятность ошибки второго рода β
 для σ1=1,24
. Исходные данные: X-> =
 (0,889; 1,514; 2,846; 2,811; 0,84; 0,945; 0,02; -0,441; -0,796; 3,739; 0,688; 0,777; -0,233; 2,284; -0,681; 1,056; 0,21; 1,8; 0,687; -0,144; 1,285; 1,851; 1,402; 1,695; 0,533; 0,87; 0,486; 0,874; 0,312; -0,821).


x = convert('0,889; 1,514; 2,846; 2,811; 0,84; 0,945; 0,02; -0,441; -0,796; 3,739; 0,688; 0,777; -0,233; 2,284; -0,681; 1,056; 0,21; 1,8; 0,687; -0,144; 1,285; 1,851; 1,402; 1,695; 0,533; 0,87; 0,486; 0,874; 0,312; -0,821')
x = np.array(x)
n = x.shape[0]

alpha = 0.02
mu = 1.18
s0 = 1.14
s1 = 1.24

s2 = np.sum((x - mu) ** 2) / n

CHI = n * s2 / s0 ** 2

A = chi2(n).isf(1 - alpha / 2)
B = chi2(n).isf(alpha / 2)

P = 2 * min(chi2(n).cdf(CHI), chi2(n).sf(CHI))

beta = chi2(n).cdf(s0 ** 2 / s1 ** 2 * B) - chi2(n).cdf(s0 ** 2 / s1 ** 2 * A)

print(CHI)
print(A, B)
print(P)
print(beta)
""",
4:
"""
Проверка гипотез о значении дисперсии, 2

Пусть X-> =(x1,…,x30)
 – реализация случайной выборки X-> =(X1,…,X30)
 из нормального распределения N(μ;σ2)
. Проверяется на уровне значимости α=0,02
 гипотеза H0:σ=1,14
 против альтернативной гипотезы H1:σ≠1,14
 с критическим множеством вида Kα=(0;A)∪(B;+∞)
. 1) Найдите значение статистики критерия χ2
. 2) Найдите границы А и В критического множества и проверьте гипотезу H0
. 3) Найдите P
-значение критерия. 4) Найдите вероятность ошибки второго рода β
 для σ1=1,24
. Исходные данные: x-> =
 (0,889; 1,514; 2,846; 2,811; 0,84; 0,945; 0,02; -0,441; -0,796; 3,739; 0,688; 0,777; -0,233; 2,284; -0,681; 1,056; 0,21; 1,8; 0,687; -0,144; 1,285; 1,851; 1,402; 1,695; 0,533; 0,87; 0,486; 0,874; 0,312; -0,821).
 
 x = convert('0,889; 1,514; 2,846; 2,811; 0,84; 0,945; 0,02; -0,441; -0,796; 3,739; 0,688; 0,777; -0,233; 2,284; -0,681; 1,056; 0,21; 1,8; 0,687; -0,144; 1,285; 1,851; 1,402; 1,695; 0,533; 0,87; 0,486; 0,874; 0,312; -0,821')
x = np.array(x)
n = x.shape[0]

alpha = 0.02
s0 = 1.14
s1 = 1.24

CHI = (n - 1) * x.var(ddof=1) / s0 ** 2

A = chi2(n - 1).isf(1 - alpha / 2)
B = chi2(n - 1).isf(alpha / 2)

P = 2 * min(chi2(n - 1).cdf(CHI), chi2(n - 1).sf(CHI))

beta = chi2(n - 1).cdf(s0 ** 2 / s1 ** 2 * B) - chi2(n - 1).cdf(s0 ** 2 / s1 ** 2 * A)

print(CHI)
print(A, B)
print(P)
print(beta)
""",
5:
"""
Проверка гипотез о равенстве двух средних
Пусть X-> =(x1,…,x25)
 – реализация случайной выборки X-> =(X1,…,X25)
 из нормального распределения N(μx;0,72)
, а Y-> =(y1,…,y30)
 – реализация случайной выборки Y-> =(Y1,…,Y30)
 из нормального распределения N(μy;1,42)
. Известно, что X-> 
 и Y->
 независимы. Проверяется гипотеза H0:μx=μy
 против альтернативной гипотезы H1:μx>μy
. При уровне значимости α
 применяется критерий с критической областью {Z>A}
, где статистика критерия Z=Z(X->,Y-> )
 – это нормированная разность X¯−Y¯
, A=Aα
 – зависящее от α
 критическое значение. Соответствующее критическое множество имеет вид Kα=(Aα;∞)
. 1) Найдите значение статистики критерия Zнабл.=Z(x-> ,y-> )
. 2) Найдите P
-значение критерия. 3) Найдите критическое значение A
, критическое множество Kα
 и проверьте гипотезу H0
 при α=0,02
. 4) Найдите мощность критерия W
 в случае μx−μy=0,1
 и α=0,02
. Исходные данные: x-> =
 (3,842; 3,374; 4,18; 4,5; 4,247; 4,412; 3,756; 3,946; 3,729; 3,948; 3,631; 2,992; 4,324; 3,919; 3,059; 4,524; 3,565; 4,236; 4,71; 4,29; 4,998; 3,336; 4,482; 3,721; 3,59); y-> =
 (3,19; 3,564; 4,079; 2,369; 5,261; 4,652; 1,849; 6,084; 6,654; 5,65; 3,748; 2,501; 5,476; 3,436; 5,711; 4,292; 5,367; 4,499; 4,989; 4,015; 6,5; 4,178; 4,563; 6,636; 2,113; 2,221; 5,357; 2,358; 6,721; 3,421).
 
!код
 x = convert('3,842; 3,374; 4,18; 4,5; 4,247; 4,412; 3,756; 3,946; 3,729; 3,948; 3,631; 2,992; 4,324; 3,919; 3,059; 4,524; 3,565; 4,236; 4,71; 4,29; 4,998; 3,336; 4,482; 3,721; 3,59')
x = np.array(x)
n = x.shape[0]

y = convert('3,19; 3,564; 4,079; 2,369; 5,261; 4,652; 1,849; 6,084; 6,654; 5,65; 3,748; 2,501; 5,476; 3,436; 5,711; 4,292; 5,367; 4,499; 4,989; 4,015; 6,5; 4,178; 4,563; 6,636; 2,113; 2,221; 5,357; 2,358; 6,721; 3,421')
y = np.array(y)
m = y.shape[0]

sx = 0.7
sy = 1.4
alpha = 0.02
delta = 0.1

z = (x.mean() - y.mean()) / np.sqrt(sx ** 2 / n + sy ** 2 / m)

P = Z.sf(z)

A = Z.isf(alpha)

beta = 1 / 2 + Phi0(A - np.sqrt(m * n) / np.sqrt(m * sx ** 2 + n * sy ** 2) * delta)
W = 1 - beta

print(z)
print(P)
print(A)
print(W)
""",
6:
"""
Проверка гипотез о равенстве трёх средних

Для трех групп финансовых показателей A: (X1;...;X27)
, B: (Y1;...;Y33)
, C: (Z1;...;Z39)
, которые по предположению независимы и распределены, соответственно, по трем нормальным законам N(μx,σ2)
, N(μy,σ2)
, N(μz,σ2)
 (с одинаковой неизвестной дисперсией σ2
) на уровне значимости α=0,01
 с помощью F-критерия (Фишера) проверяется гипотеза H0:μx=μy=μz
 о совпадении ожидаемых значений показателей. Конкретные значения всех показателей указаны ниже. 1) По данным значениям показателей найдите межгрупповую дисперсию. 2) По этим же данным найдите среднюю групповую дисперсию. 3) Найдите значение статистики F-критерия, критическое множество Kα
 и проверьте гипотезу H0
. 4) Найдите P
-значение критерия и сделайте выводы.
Значения показателей группы A: (0,616; 1,046; 2,575; -0,344; 2,339; -0,68; 3,739; 2,251; -1,252; 3,536; -0,491; 5,556; 4,856; -1,68; 2,33; 1,345; 2,829; 2,539; 3,304; 3,497; 0,211; 3,563; 0,94; 3,642; 1,956; 3,919; 3,568). Значения показателей группы B: (2,834; 1,504; -0,678; 5,619; 0,97; 1,617; 3,768; -1,309; 3,343; -1,778; -0,854; 1,04; 2,83; -2,335; 4,853; 5,6; 4,341; 4,362; 3,52; 1,151; -0,621; -2,88; 1,697; 1,753; 0,211; 2,157; 1,989; 2,457; 1,399; 1,61; -0,558; 2,132; 2,293). Значения показателей группы C: (2,398; -2,77; 4,679; 1,924; 0,574; 5,329; 0,699; 4,457; -0,3; 1,682; -1,34; 0,046; -1,096; 1,935; 2,411; 4,134; 5,643; 3,071; 6,526; 4,941; 2,844; -0,43; -2,066; 0,22; 0,317; -1,923; 1,38; -2,485; 0,111; -0,542; 4,78; 1,93; 0,462; 5,487; -3,547; 2,933; -0,987; -0,21; 3,955).
!код
x = convert('0,616; 1,046; 2,575; -0,344; 2,339; -0,68; 3,739; 2,251; -1,252; 3,536; -0,491; 5,556; 4,856; -1,68; 2,33; 1,345; 2,829; 2,539; 3,304; 3,497; 0,211; 3,563; 0,94; 3,642; 1,956; 3,919; 3,568')
x = np.array(x)
n1 = x.shape[0]

y = convert('2,834; 1,504; -0,678; 5,619; 0,97; 1,617; 3,768; -1,309; 3,343; -1,778; -0,854; 1,04; 2,83; -2,335; 4,853; 5,6; 4,341; 4,362; 3,52; 1,151; -0,621; -2,88; 1,697; 1,753; 0,211; 2,157; 1,989; 2,457; 1,399; 1,61; -0,558; 2,132; 2,293')
y = np.array(y)
n2 = y.shape[0]

z = convert('2,398; -2,77; 4,679; 1,924; 0,574; 5,329; 0,699; 4,457; -0,3; 1,682; -1,34; 0,046; -1,096; 1,935; 2,411; 4,134; 5,643; 3,071; 6,526; 4,941; 2,844; -0,43; -2,066; 0,22; 0,317; -1,923; 1,38; -2,485; 0,111; -0,542; 4,78; 1,93; 0,462; 5,487; -3,547; 2,933; -0,987; -0,21; 3,955')
z = np.array(z)
n3 = z.shape[0]

xyz = pd.DataFrame([x, y, z]).T
xyz_all = np.concatenate([x, y, z])
n = [n1, n2, n3]
N = sum(n)
k = 3

alpha = 0.01

d2 = np.sum((xyz.mean() - xyz_all.mean()) ** 2 * n) / N

meanvar = np.sum(xyz.var(ddof=0) * n) / N

print('проверка:', (d2 + meanvar), xyz_all.var(ddof=0))
print()

SSE = N * meanvar
MSE = SSE / (N - k)
SSTR = N * d2
MSTR = SSTR / (k - 1)
F = MSTR / MSE

print('H0 не отвергается если 1 < 2:', F, f(k - 1, N - k).isf(alpha))

P = f(k - 1, N - k).sf(F)

print()
print(d2)
print(meanvar)
print(F)
print(P)
"""
     }
        if search:
            numbers = []
            for i, j in sklad.items():
                if search in j:
                    numbers.append(i)
            return 'есть в этих номерах: ', numbers

        return sklad[number]
